Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / 66287a39075fa80408c6d9e60e0b2baed88fd6be
**Workflow run:** https://github.com/JohnMonteir0/eks-with-cilium/actions/runs/17518775074

**Plan (last ~500 lines):**
```
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.13.4"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "cilium"
        }
      + set {
          + name  = "region"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-0a2ec5d5f7544f642"
        }
    }

  # module.helm.helm_release.ebs_csi_driver will be created
  + resource "helm_release" "ebs_csi_driver" {
      + atomic                     = false
      + chart                      = "aws-ebs-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-ebs-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/aws-ebs-csi-driver"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.30.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "controller.serviceAccount.name"
          + value = "ebs-csi-controller-sa"
        }
      + set {
          + name  = "enableVolumeResizing"
          + value = "true"
        }
      + set {
          + name  = "enableVolumeScheduling"
          + value = "true"
        }
      + set {
          + name  = "enableVolumeSnapshot"
          + value = "true"
        }
    }

  # module.helm.helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.15.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "policy"
          + value = "sync"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
    }

  # module.helm.helm_release.ingress-nginx will be created
  + resource "helm_release" "ingress-nginx" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "service":
                    "annotations":
                      "service.beta.kubernetes.io/aws-load-balancer-nlb-target-type": "ip"
                      "service.beta.kubernetes.io/aws-load-balancer-scheme": "internet-facing"
                      "service.beta.kubernetes.io/aws-load-balancer-subnets": "subnet-09e00742bdc368556,subnet-0217c57a178ff79f2,subnet-06150ae156aa1518c"
                      "service.beta.kubernetes.io/aws-load-balancer-type": "nlb"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.12.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.1.6"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "settings.clusterEndpoint"
          + value = "https://7D9AD643A0174E0E1D4DC44F94B42C46.gr7.us-east-1.eks.amazonaws.com"
        }
      + set {
          + name  = "settings.clusterName"
          + value = "cilium"
        }
      + set {
          + name  = "settings.interruptionQueue"
          + value = "Karpenter-cilium"
        }
    }

  # module.helm.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = true
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "prometheus":
                  "prometheusSpec":
                    "podMonitorNamespaceSelector": {}
                    "podMonitorSelector": {}
                    "podMonitorSelectorNilUsesHelmValues": false
                    "serviceMonitorNamespaceSelector": {}
                    "serviceMonitorSelector": {}
                    "serviceMonitorSelectorNilUsesHelmValues": false
            EOT,
        ]
      + verify                     = false
      + version                    = "65.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.helm.kubernetes_service_account.aws_load_balancer_controller will be created
  + resource "kubernetes_service_account" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.helm.kubernetes_service_account.eks_ebs_csi_controller will be created
  + resource "kubernetes_service_account" "eks_ebs_csi_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "ebs-csi-controller-sa"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.helm.kubernetes_service_account.external_dns will be created
  + resource "kubernetes_service_account" "external_dns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.network.helm_release.cilium will be created
  + resource "helm_release" "cilium" {
      + atomic                     = false
      + chart                      = "cilium"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy cilium"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cilium"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://helm.cilium.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.17.4"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "egressMasqueradeInterfaces"
          + value = "eth+"
        }
      + set {
          + name  = "endpointRoutes.enabled"
          + value = "true"
        }
      + set {
          + name  = "eni.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.metrics.enableOpenMetrics"
          + value = "true"
        }
      + set {
          + name  = "hubble.metrics.enabled[0]"
          + value = "dns"
        }
      + set {
          + name  = "hubble.metrics.enabled[1]"
          + value = "drop"
        }
      + set {
          + name  = "hubble.metrics.enabled[2]"
          + value = "tcp"
        }
      + set {
          + name  = "hubble.metrics.enabled[3]"
          + value = "flow"
        }
      + set {
          + name  = "hubble.metrics.enabled[4]"
          + value = "port-distribution"
        }
      + set {
          + name  = "hubble.metrics.enabled[5]"
          + value = "icmp"
        }
      + set {
          + name  = "hubble.metrics.enabled[6]"
          + value = "httpV2:exemplars=true;labelsContext=source_ip\\,source_namespace\\,source_workload\\,destination_ip\\,destination_namespace\\,destination_workload\\,traffic_direction"
        }
      + set {
          + name  = "hubble.metrics.serviceMonitor.enabled"
          + value = "false"
        }
      + set {
          + name  = "hubble.relay.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.tls.auto.method"
          + value = "helm"
        }
      + set {
          + name  = "hubble.ui.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.className"
          + value = "nginx"
        }
      + set {
          + name  = "hubble.ui.ingress.enabled"
          + value = "true"
        }
      + set {
          + name  = "hubble.ui.ingress.hosts[0]"
          + value = "hubble.298367968222.realhandsonlabs.net"
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].path"
          + value = "/"
        }
      + set {
          + name  = "hubble.ui.ingress.paths[0].pathType"
          + value = "Prefix"
        }
      + set {
          + name  = "ipam.mode"
          + value = "eni"
        }
      + set {
          + name  = "k8sServiceHost"
          + value = "7D9AD643A0174E0E1D4DC44F94B42C46.gr7.us-east-1.eks.amazonaws.com"
        }
      + set {
          + name  = "k8sServicePort"
          + value = "443"
        }
      + set {
          + name  = "kubeProxyReplacement"
          + value = "true"
        }
      + set {
          + name  = "operator.prometheus.enabled"
          + value = "false"
        }
      + set {
          + name  = "operator.prometheus.serviceMonitor.enabled"
          + value = "false"
        }
      + set {
          + name  = "prometheus.enabled"
          + value = "false"
        }
      + set {
          + name  = "prometheus.serviceMonitor.enabled"
          + value = "false"
        }
      + set {
          + name  = "routingMode"
          + value = "native"
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
